Revit 2027 API
FamilySymbol.GetStructuralSection Method
 Gets the structural section from element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSection GetStructuralSection()
Public Function GetStructuralSection As StructuralSection
public:
StructuralSection^ GetStructuralSection()
member GetStructuralSection : unit -> StructuralSection
Return Value
StructuralSection
 The structural section. null if the family symbol does not contain a structural section.
Remarks
 Only beams, braces and structural columns can have a structural section. To check if the element can have structural section use the CanHaveStructuralSection() method.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace